package com.Hxin.leetcode.middle.month1.day26;

import java.util.ArrayList;
import java.util.HashSet;
import java.util.List;
import java.util.Set;

/**
 * 请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。
 * <p>
 * 数字 1-9 在每一行只能出现一次。
 * <p>
 * 数字 1-9 在每一列只能出现一次。
 * <p>
 * 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
 * <p>
 * 注意：
 * <p>
 * 一个有效的数独（部分已被填充）不一定是可解的。
 * 只需要根据以上规则，验证已经填入的数字是否有效即可。
 * 空白格用 '.' 表示。
 * <p>
 * <p>
 * 示例 1：
 * <p>
 * 输入：board =
 * <p>
 * [["5","3",".",".","7",".",".",".","."]
 * <p>
 * ,["6",".",".","1","9","5",".",".","."]
 * <p>
 * ,[".","9","8",".",".",".",".","6","."]
 * <p>
 * ,["8",".",".",".","6",".",".",".","3"]
 * <p>
 * ,["4",".",".","8",".","3",".",".","1"]
 * <p>
 * ,["7",".",".",".","2",".",".",".","6"]
 * <p>
 * ,[".","6",".",".",".",".","2","8","."]
 * <p>
 * ,[".",".",".","4","1","9",".",".","5"]
 * <p>
 * ,[".",".",".",".","8",".",".","7","9"]]
 * <p>
 * 输出：true
 * <p>
 * 示例 2：
 * <p>
 * 输入：board =
 * <p>
 * [["8","3",".",".","7",".",".",".","."]
 * <p>
 * ,["6",".",".","1","9","5",".",".","."]
 * <p>
 * ,[".","9","8",".",".",".",".","6","."]
 * <p>
 * ,["8",".",".",".","6",".",".",".","3"]
 * <p>
 * ,["4",".",".","8",".","3",".",".","1"]
 * <p>
 * ,["7",".",".",".","2",".",".",".","6"]
 * <p>
 * ,[".","6",".",".",".",".","2","8","."]
 * <p>
 * ,[".",".",".","4","1","9",".",".","5"]
 * <p>
 * ,[".",".",".",".","8",".",".","7","9"]]
 * <p>
 * 输出：false
 * <p>
 * 解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。
 *
 * @Author HkisY
 * @Version 0.0.1
 * @Date 2023/8/23  20:15
 */
public class IsValidSudoku {
    public static void main(String[] args) {

    }

    public boolean isValidSudoku(char[][] board) {
        int[][] rows = new int[9][9];
        int[][] columns = new int[9][9];
        int[][][] subBoxes = new int[3][3][9];
        for (int i = 0; i < 9; i++) {
            for (int j = 0; j < 9; j++) {
                char c = board[i][j];
                if (c != '.') {
                    int index = c - '0' - 1;
                    rows[i][index]++;
                    columns[j][index]++;
                    subBoxes[i / 3][j / 3][index]++;
                    if (rows[i][index] > 1 || columns[j][index] > 1 || subBoxes[i / 3][j / 3][index] > 1) {
                        return false;
                    }
                }
            }
        }
        return true;
    }
}
